
{
  "articles":[
{
    "id": 79,
   
    "context": "WORLD",
    "topic": "Docker",
    "title": "Where does our food come from – why should we care?",
    "publishedDate": "2018-11-06",
    "author": "Dr. Karen Scott",
    "brief": "Our food comes from plants. Even animals that have been killed for meat have eaten plants, or have eaten animals that have eaten plants. Do read this article to find out where our food comes from and why we should care about it?",
  
   
    "articleData": [
      {
        "role": "title",
        "text": "Where does our food come from – why should we care?"
      },
      {
        "role": "paragraph",
        "text": "The food we eat feeds our microbes, gives us energy and nutrition, and keeps us healthy. The choices we make about our food clearly affects our health, but also has a huge effect on the world around us. We need to make more effort to choose correctly."
      },
      {
        "role": "paragraph",
        "text": "Sometimes it seems that everywhere we look, someone has an opinion on what we should be eating. Television is full of programmes telling us how and what to cook – suitable for a range of abilities. In supermarkets we are continually targeted with special offers and promotions, encouraging us to buy things we do not need that are not on our shopping list. In magazines there are page long adverts, letting us know many reasons why our lives will be enriched if we purchase product Y, and perhaps even how we will be missing out if we do not. Even newspapers print articles telling us which foods are “super” this week, and will endow us with youthful skin, long life, and/or a svelte figure. Next week there will be another article with a new superfood, and one demoting last week’s superfood to the “standard” food, or even demonising it completely."
      },
      {
        "role": "paragraph",
        "text": "Yet even with all this focus on what we should be eating, do we really care about where our food comes from? Shouldn’t we really be more concerned with the provenance and sustainability of our food, rather than whether it is “super”?"
      },
      {
        "role": "paragraph",
        "text": "Quinoa is a grain with a high nutrient content, high protein content (including all nine essential amino acids) and is also a source of some essential micronutrients and vitamins. By popular measures, a “superfood”. Quinoa is primarily grown in South America (Peru, Chile and Bolivia) where it is an important dietary staple. The increased demand and resultant export of quinoa has contributed considerably to the Peruvian economy. On the other hand, the cost increases associated with the increased worldwide demand means that the local Andean population now struggle to afford to include this healthy food in their own diets. Additionally the enlarged land area now used for quinoa production has reduced the amount of land available to grow alternative crops, and this reduced diversity has a negative impact on soil quality and on wildlife. Not so “super”."
      },
      {
        "role": "paragraph",
        "text": "Another healthy food-fad with a negative environmental impact is avocado. The current demand for avocados as part of the ‘green smoothie’ revolution has resulted in considerable deforestation in Mexico to make way for avocado plantations. Avocado trees also need a lot of water, which, given that they are frequently grown in climates with problems of drought, is clearly not sustainable."
      },
      {
        "role": "paragraph",
        "text": "The other factor is price – we are constantly persuaded that we should be looking for the best deal, getting those “2-for-1 offers”, or buying our food in the specific supermarket “saving you the most on your weekly shop”. The reality is that we spend a smaller % of our income on food today than we ever have – and this is not because we eat less, far from it. But if we think about it, it is not the large supermarket that loses money when it introduces offers. Buy one get one free offers on, for example fruit, usually mean that the farmer is only getting paid for one of every two oranges sold. Is this fair? If you ask a people doing their food shopping if they think that milk should cost more than water – most people would say “yes of course”. Yet at the milk counter in the supermarket they automatically reach for the “special offer”, cheapest product. Sometimes the farmer gets paid less for the milk he sells the supermarket than it costs to produce. Again if you asked people in the shop if they thought this was fair, they would no doubt say no, but they still reach for the “special offer”, cheapest product. This is already driving smaller dairy farmers out of business. Is this what we want? We as consumers, as well as the supermarkets, have to take responsibility."
      },
      {
        "role": "paragraph",
        "text": "Similarly with meat products and eggs. Most people, when asked about the best and most humane ways to look after animals on farms, prefer the low density, outside methods often depicted in children’s story books. Yet when we reach the meat counter in the supermarket we are more likely to reach for the cheaper product than the one from the farm which assures humane conditions, but which may cost twice as much. Such farming methods are more expensive to run, so the products have to cost more. We have to make more effort to include our instinctive morality when we are actually making purchases of food."
      },
      {
        "role": "paragraph",
        "text": "We have also become accustomed to being able to buy anything, at any time of year. If we want to buy fruit that is out-of-season in our own country, it will be in-season somewhere else and can be flown across the world for display in our local supermarket. When we ask people if they care about global warming – most will agree that it is a big problem, threatening the world. Yet they will buy specific fruits or vegetables that have been flown 1000s of miles, in aeroplanes contributing CO2 emissions, without a thought. Locally produced food, eaten in season, completely avoids this non-essential contribution to global warming."
      },
      {
        "role": "paragraph",
        "text": "Feeding our microbes is easy – they just eat our leftovers. But perhaps we also need to think about them. Food produced in intensively farmed conditions contains more pesticide and antibiotic residues than foods produced less intensively. Depending where we live, imported foods may have fewer controls on additives and production methods than those produced locally. Although specific studies have not been carried out to gauge the effect of such residues on our microbes, it is likely that there will be an effect. The healthy compounds in fruits develop best when they are allowed to ripen on the bush/tree and are not harvested unripe and then transported across the world. Our ancestors ate fresh foods in season and produced locally. People living in remote areas of the modern world without access to the diverse range of foods in a supermarket have a more diverse, healthy microbiota than those of us consuming “western diets”. Our microbes do not need, and potentially do not want, intensively produced foods."
      },
      {
        "role": "paragraph",
        "text": "Many of us are in the fortunate position of being able to afford to pay a bit more for our food, and thus to support it being produced in the way we would prefer if we stopped to think about it. This is why we DO have to stop to think and not automatically reach for the cheapest product on the shelf.  If we do not support farmers who are producing food in the most humane way, they will go out of business and we will be left with no choice but to buy mass-produced, often imported, food. Is this really what we want?"
      },
      {
        "role": "paragraph",
        "text": "We have become so accustomed to paying less for our food, and looking for bargains, that we seem to care less about the quality and provenance than the price. Unless we change our outlook we will affect whole populations and environments forever. We need to stop the disconnect between our thoughts about what our foods should be, and what we actually buy, and we need to do it before it is too late."
      }
    ],
    "vocabulary": [
      {
        "word": "Dairy farming",
        "meaning": "Dairy farming is a class of agriculture for long-term production of milk, which is processed (either on the farm or at a dairy plant, either of which may be called a dairy) for eventual sale of a dairy product."
      },
      {
        "word": "Microbe",
        "meaning": "a microorganism, especially a pathogenic bacterium"
      },
      {
        "word": "Superfood",
        "meaning": "a food considered exceptionally good for one’s health and for boosting the immune system owing to its naturally high content of vitamins, minerals, fiber, antioxidants, or omega-3 fatty acids:"
      },
      {
        "word": "Supermarket",
        "meaning": "a large retail market that sells food and other household goods and that is usually operated on a self-service basis."
      }
    ],
    "curriculams": [
      {
        "grade": 6,
        "syllabus": "CBSE",
        "subject": "Science",
        "subSubject": "",
        "chapterName": "Food: Where Does it Come From?",
        "chapterNumber": "1",
        "code": ""
      }
    ],
   
    "derivedDatas": [
      {
        "id": 229,
        "name": "wordCount",
        "isNum": true,
        "score": 1381,
        "value": null
      },
      {
        "id": 230,
        "name": "fleschScore",
        "isNum": true,
        "score": 6728,
        "value": null
      },
      {
        "id": 231,
        "name": "levelOfReading",
        "isNum": false,
        "score": null,
        "value": "Easily understood by 13 to 15 year-old"
      }
    ]
  },{
    "id":"80",
    "topic": "Development",
    "title": "Build A Text-To-Speech App Using Client-Side JavaScript",
    "articleData":[
      {
        "role":"title",
        "text":"Build A Text-To-Speech App Using Client-Side JavaScript"
      },
      {
        "role":"paragraph",
        "text":"A Fusion of OCR Technology (Tesseract.js) & Web Speech API. Full Code Implementation included."
      },
      {
        "role": "image",
        "source": "Amazon",
        "url": "https://miro.medium.com/max/875/1*ZYJDSDmKSzqp19W9CTnPVA.png",
        "author": "Somebody"
      },
      {
        "role":"paragraph",
        "text":"In today’s information age, impacts of digital transformations are present across varying industries and sectors. Following the onset of a Global Pandemic, this has accelerated several domains such as Healthcare and Finance to recognise the importance of data and the need for digital tools to support these ongoing paradigm shifts."
      },
      {
        "role":"heading2",
        "text":"OCR (Optical Character Recognition) Technology"
      },
      {
        "role":"paragraph",
        "text":"In particular, OCR technology has been a gamechanger in driving this digital age to reinforce data-fueled professions such as Data Science (AI & ML) and Data Analytics."
      },
      {
        "role":"paragraph",
        "text":"Most notably, the capability of OCR technology to extract textual content in images eliminates the manually intensive need to re-type the text, effectively saving overhead costs (time+manpower)."
      }
    



    ]
  },
  {
    "id":"81",
    "topic": "Web Development",
    "title": "Where does our food come from – why should we care?"
  },
  {
    "id":"82",
    "topic": "Design",
    "title": "Where does our food come from – why should we care?"
  },
  {
    "id":"83",
    "topic": "Microservices",
    "title": "What are microservices?",
    "brief":"Microservices are an architectural and organizational approach to software development where software is composed of small independent services that communicate over well-defined APIs. These services are owned by small, self-contained teams.Microservices architectures make applications easier to scale and faster to develop, enabling innovation and accelerating time-to-market for new features.",
    
    "articleData": [
      {
        "role": "title",
        "text": "What are microservices?"
      },
      {
        "role": "heading2",
        "text": "Overview"
      },
      {
        "role": "paragraph",
        "text": "Microservices are an architectural approach to building applications. As an architectural framework, microservices are distributed and loosely coupled, so one team’s changes won’t break the entire app. The benefit to using microservices is that development teams are able to rapidly build new components of apps to meet changing business needs"
      },
      {
        "role": "image",
        "source": "Amazon",
        "url": "https://d1.awsstatic.com/Developer%20Marketing/containers/monolith_1-monolith-microservices.70b547e30e30b013051d58a93a6e35e77408a2a8.png",
        "author": "Somebody"
      },
      {
        "role": "heading2",
        "text": "A way to build apps, optimized for DevOps and CI/CD"
      },
      {
        "role": "paragraph",
        "text": "What sets a microservices architecture apart from more traditional, monolithic approaches is how it breaks an app down into its core functions. Each function is called a service, and can be built and deployed independently, meaning individual services can function (and fail) without negatively affecting the others. This helps you to embrace the technology side of DevOps and make constant iteration and delivery (CI/CD) more seamless and achievable."
      },
      {
        "role": "paragraph",
        "text": "Think of your last visit to an online retailer. You might have used the site’s search bar to browse products. That search represents a service. Maybe you also saw recommendations for related products—recommendations pulled from a database of shopper preferences. That’s also a service. Did you add an item to an online cart? You guessed it, another service."
      },
      {
        "role": "paragraph",
        "text": "So, a microservice is a core function of an application and it runs independent of other services, but a microservices architecture is about more than just the loose coupling of an app’s core functions—it’s about restructuring development teams and interservice communication in a way that prepares for inevitable failures, future scalability, and new feature integration."
      },
      {
        "role": "heading2",
        "text": "From SOA to microservices"
      },
      {
        "role": "paragraph",
        "text": "What's the difference? Microservices can communicate with each other, usually statelessly, so apps built in this way can be more fault tolerant, less reliant on a single ESB. This also allows dev teams to choose their own tools, since microservices can communicate through language-agnostic application programming interfaces (APIs)."
      },
      {
        "role": "paragraph",
        "text": "Given the history of SOA, microservices are not actually all that new of an idea. However, microservices have become more viable thanks to advancements in containerization technologies. With Linux containers, you’re now able to run multiple parts of an app independently, on the same hardware, with much greater control over their individual pieces and life cycles. Along with APIs and DevOps teams, containerized microservices are the foundation for cloud-native applications."
      },
      {
        "role": "image",
        "source": "Amazon",
        "url": "https://spring.io/images/diagram-microservices-dark-4a2e5817aac093437f4f3b3a5be8be88.svg",
        "author": "Somebody"
      },
      {
        "role": "heading2",
        "text": "And the challenges?"
      },
      {
        "role": "paragraph",
        "text": "If your organization is thinking about shifting to a microservices architecture, expect to change the way people work, not just the apps. Organizational and cultural changes are identified as challenges in part because each team will have its own deployment cadence and will be responsible for a unique service with its own set of customers. Those may not be typical developer concerns, but they will be essential to a successful microservices architecture."
      },
      {
        "role": "paragraph",
        "text": "Beyond culture and process, complexity and efficiency are two major challenges of a microservice-based architecture. John Frizelle, platform architect for Red Hat Mobile, laid out these eight challenge categories in his 2017 talk at Red Hat Summit:"
      },
      {
        "role": "ordered_list",
        "heading": "",
        "points": ["You have to spend time identifying dependencies between your services. Be aware that completing one build might trigger several other builds, due to those dependencies. You also need to consider the effects that microservices have on your data.","Remote debugging through your local integrated development environment (IDE) isn’t an option and it won’t work across dozens or hundreds of services. Unfortunately there’s no single answer to how to debug at this time."]
       
      },
      {
        "role":"unordered_list",
        "heading":"Potential Use-Cases",
        "points":["Data Entry For Business Documents","Aids for the Visually Impaired","Converting scanned documents to machine-readable text for data processing"]

      }
    ]
    
  }
  ]
}